test/socketio-load-test.yml
config:
  target: "http://localhost:3100"  # 서버 주소
  phases:
    - duration: 15                 # 총 15초간
      arrivalRate: 10              # 초당 10명씩 → 최대 150명
  engine: "socketio"
  socketio:
    transports: ["websocket"]

scenarios:
  - name: "minimal join test"
    weight: 1
    flow:
      - emit:
          channel: "create_room"
          data: "testroom"
      - emit:
          channel: "join_room"
          data:
            roomId: "testroom"
            userName: "user_{{ $randomNumber(1,1000) }}"
      - think: 2
      - emit:
          channel: "cursor_move"
          data:
            roomId: "testroom"
            userName: "user_{{ $randomNumber(1,1000) }}"
            x: 123
            y: 456
      - think: 1

  - name: "image sender"
    weight: 1
    flow:
      - emit:
          channel: "join_room"
          data:
            roomId: "testroom"
            userName: "user_{{ $randomNumber(1,1000) }}"
      - think: 2
      - emit:
          channel: "object_add"
          data:
            roomId: "testroom"
            object:
              objectType: "image"
              transferType: "base64"
              fileName: "TimeTOGO-aws.drawio (2).jpg"
              data: "iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mP8z8BQDwAEhQGAhKmMIQAAAABJRU5ErkJggg=="
      - think: 1